// Credential dumping with mm.exe (Flags 12 & 13)

DeviceProcessEvents
| where DeviceName == "azuki-sl"
| where FileName == "mm.exe"
| project Timestamp,
         FileName,
         ProcessCommandLine
| order by Timestamp asc